Revit 2027 API
SlabEdge.AddSegment Method
Add segments to the slab edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override void AddSegment(
	Reference targetRef
)
Public Overrides Sub AddSegment (
	targetRef As Reference
)
public:
virtual void AddSegment(
	Reference^ targetRef
) override
abstract AddSegment :
        targetRef : Reference -> unit
override AddSegment :
        targetRef : Reference -> unit
Parameters
targetRef Reference
Segment's reference on which want to be added.
Exceptions
Exception | Condition
ArgumentNullException |  This exception will be thrown in following cases: 1. Input targetRef is null. 2. Input targetRef is not null but contains nothing.
InvalidOperationException |  This exception will be thrown in following cases: 1. Input targetRef has already been added into the slab edge. 2. Internal code fails to create the segment object. 3. Regeneration fails.
ArgumentOutOfRangeException |  This exception will be thrown if the reference is suitable for creating a slab edge as required. The reference allowed is : 1. Model Line 2. Floor's horizontal edges 3. Other slab edge's horizontal edges
See Also
Reference
SlabEdge Class
Autodesk.Revit.DB Namespace